app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-15 15:26:33.006876"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    # byebug
    @article.update(title: params[:article][:title], description: params[:article][:description])